project_directory/app/controllers/api/art_controller.rb

    def index
        @art = Art.all
---
SELECT "arts".* FROM "arts"