project_directory/app/controllers/api/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save!
---
INSERT INTO "users" ("name", "age", "location") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Lance"], ["age", 30], ["location", "California"]]